#  Baby names mini-project

### Import  libraries:

In [172]:
import altair as alt
import pandas as pd
import geopandas as gpd 
from IPython.display import display

alt.data_transformers.enable('json') 

from ipywidgets import interact, interactive, fixed, interact_manual,Dropdown
import ipywidgets as widgets

pass

### Reading data:

In [173]:
#### code taken form altair tutorial

#national dataset
na_data = pd.DataFrame(pd.read_csv("nat-data.tsv", sep="\t"))
na_data.drop(na_data[na_data.preusuel == '_PRENOMS_RARES'].index, inplace=True)
na_data.drop(na_data[na_data.annais == 'XXXX'].index, inplace=True)

# dataset per departement
names = pd.read_csv("dpt2020.csv", sep=";")
names.drop(names[names.preusuel == '_PRENOMS_RARES'].index, inplace=True)
names.drop(names[names.dpt == 'XX'].index, inplace=True)
names.drop(names[names.dpt == 'NAN'].index, inplace=True)
names.sample(10)

         sexe  preusuel annais dpt  nombre
941749      1      KARL   1986  59       9
1687103     1   YANNICK   1998  33       5
876729      1     JOHAN   1973  13      10
228550      1   BERNARD   1915  53      13
1104695     1     MARCO   2009  59       6
3140603     2    MARION   1988  70       5
281766      1   CHAHINE   2018  68       3
2682949     2  JOCELYNE   1954  05      13
2588928     2  HORTENSE   1905  21       3
638266      1   GILBERT   1902  51      16

In [174]:
# Just to test visualisation
#na_data=na_data[50999:150000]
na_data.shape

(586591, 4)

### DATA MANIPULATION:

###### National data

In [175]:
df1=na_data.loc[na_data['preusuel'] == 'LÉA']

List_name=na_data['preusuel'].unique()

List_year=na_data['annais'].unique()

nat_data_name={}
    
List_year.sort()
List_year[0]

'1900'

In [176]:

#distribution by year
for i in range(len(List_year)):
    nat_data_name[List_year[i]]=na_data.loc[na_data['annais'] == List_year[i]]

In [177]:
print(nat_data_name['1900']) #perfect

        sexe  preusuel annais  nombre
4463       1     ABDON   1900       4
5405       1      ABEL   1900     428
6029       1   ABRAHAM   1900      19
6251       1   ACHILLE   1900     205
6369       1  ACHILLES   1900       6
...      ...       ...    ...     ...
618485     2      ZITA   1900       5
618614     2      ZOEE   1900       4
619337     2       ZOÉ   1900     131
619581     2     ZULMA   1900      32
619618     2    ZULMEE   1900       5

[1705 rows x 4 columns]

#### Department data

In [94]:
year_data_name={}

List_dep=names['dpt'].unique()

#distribution by year
for i in range(len(List_year)):
    year_data_name[List_year[i]]=names.loc[names['annais'] == List_year[i]]

In [95]:
print(year_data_name['1984'])

         sexe  preusuel annais dpt  nombre
10895       1     AARON   1984  75       3
12486       1       ABD   1984  62       4
12784       1  ABDALLAH   1984  13       6
12785       1  ABDALLAH   1984  38       3
12786       1  ABDALLAH   1984  57       5
...       ...       ...    ...  ..     ...
3726799     2     ZOHRA   1984  93      11
3726800     2     ZOHRA   1984  94       4
3726801     2     ZOHRA   1984  95       5
3727392     2   ZOUBIDA   1984  95       3
3727432     2  ZOULIKHA   1984  59       3

[37556 rows x 5 columns]

In [96]:
# List_name_per_dep=dep_data_name['84']['preusuel'].unique()
# List_year_per_dep=dep_data_name['84']['annais'].unique()
# List_year_per_dep

dep_year_popular_name={}
sub_dp_year_popular_name={}
sub_sub_dp_year_popular_name={}

for i in range(len(List_year)):
    dep_year_popular_name[List_year[i]]=[]
    for j in List_dep:
        sub_dp_year_popular_name[j]=year_data_name[List_year[i]].loc[year_data_name[List_year[i]]['dpt'] ==j]
        dep_year_popular_name[List_year[i]].append(sub_dp_year_popular_name[j])

In [10]:
dep_year_popular_name["2016"]

[         sexe  preusuel annais dpt  nombre
 11996       1     AARON   2016  84      20
 13150       1  ABDALLAH   2016  84       5
 16325       1  ABDELLAH   2016  84       3
 23285       1   ACHILLE   2016  84       3
 23694       1    ACHRAF   2016  84       4
 ...       ...       ...    ...  ..     ...
 3719691     2    ZAYNEB   2016  84       4
 3721266     2     ZÉLIE   2016  84       3
 3722099     2    ZEYNEP   2016  84       3
 3723290     2       ZOE   2016  84       3
 3725809     2       ZOÉ   2016  84      28

 [669 rows x 5 columns],
          sexe      preusuel annais dpt  nombre
 12004       1         AARON   2016  92      59
 13152       1      ABDALLAH   2016  92      13
 16326       1      ABDELLAH   2016  92       7
 16866       1   ABDERRAHMAN   2016  92       5
 17039       1  ABDERRAHMANE   2016  92       4
 ...       ...           ...    ...  ..     ...
 3721706     2        ZEYNAB   2016  92       4
 3721813     2        ZEYNEB   2016  92       4
 3722938     2         ZINEB   2016  92       6
 3723291     2           ZOE   2016  92       8
 3725816     2           ZOÉ   2016  92      51

 [1513 rows x 5 columns],
          sexe      preusuel annais dpt  nombre
 10888       1         AAHIL   2016  95       3
 12007       1         AARON   2016  95      59
 13155       1      ABDALLAH   2016  95      12
 15816       1    ABDELKARIM   2016  95       5
 17042       1  ABDERRAHMANE   2016  95       5
 ...       ...           ...    ...  ..     ...
 3722103     2        ZEYNEP   2016  95       9
 3722941     2         ZINEB   2016  95       4
 3725819     2           ZOÉ   2016  95      41
 3727081     2         ZOHRA   2016  95       3
 3727444     2          ZOYA   2016  95       5

 [1205 rows x 5 columns],
          sexe    preusuel annais dpt  nombre
 11987       1       AARON   2016  75      97
 13146       1    ABDALLAH   2016  75      10
 16744       1  ABDERAHMAN   2016  75       3
 16831       1  ABDERRAHIM   2016  75       3
 17488       1      ABDOUL   2016  75      11
 ...       ...         ...    ...  ..     ...
 3723002     2        ZITA   2016  75       4
 3725800     2         ZOÉ   2016  75     120
 3726291     2        ZOEY   2016  75       3
 3726332     2       ZOFIA   2016  75       3
 3727075     2       ZOHRA   2016  75       7

 [2004 rows x 5 columns],
          sexe    preusuel annais dpt  nombre
 11981       1       AARON   2016  69      64
 12540       1         ABD   2016  69      10
 13144       1    ABDALLAH   2016  69      20
 13753       1       ABDEL   2016  69       8
 15678       1  ABDELKADER   2016  69       6
 ...       ...         ...    ...  ..     ...
 3722095     2      ZEYNEP   2016  69       9
 3722557     2        ZINA   2016  69       4
 3722935     2       ZINEB   2016  69       6
 3725794     2         ZOÉ   2016  69      75
 3727074     2       ZOHRA   2016  69       8

 [1591 rows x 5 columns],
          sexe  preusuel annais dpt  nombre
 12005       1     AARON   2016  93      66
 12541       1       ABD   2016  93       4
 13153       1  ABDALLAH   2016  93      25
 13754       1     ABDEL   2016  93       5
 13904       1  ABDELALI   2016  93       3
 ...       ...       ...    ...  ..     ...
 3722558     2      ZINA   2016  93       6
 3722939     2     ZINEB   2016  93      11
 3725817     2       ZOÉ   2016  93      32
 3727079     2     ZOHRA   2016  93       5
 3727443     2      ZOYA   2016  93       3

 [1596 rows x 5 columns],
          sexe   preusuel annais dpt  nombre
 11979       1      AARON   2016  67      36
 17946       1  ABDOULLAH   2016  67       3
 18172       1   ABDULLAH   2016  67       4
 20968       1       ABEL   2016  67       5
 21861       1    ABRAHAM   2016  67       3
 ...       ...        ...    ...  ..     ...
 3719854     2      ZEÏNA   2016  67       4
 3721251     2      ZÉLIE   2016  67       7
 3722093     2     ZEYNEP   2016  67       7
 3725792     2        ZOÉ   2016  67      52
 3727138     2       ZOLA   2016  67       3

 [849 rows x 5 columns],
          sexe preusuel annais dpt  nombre
 11944       1    AARON   2016  29      29
 20945       1     ABEL   2016  29       7
 23256       1  ACHILLE   2016  29       4
 25661       1     ADAM   2016  29      20
 28357       1     ADEM   2016  29       5
 ...       ...      ...    ...  ..     ...
 3692918     2   YAËLLE   2016  29       7
 3704668     2    YOUNA   2016  29      19
 3706097     2     YUNA   2016  29      16
 3721225     2    ZÉLIE   2016  29      10
 3725755     2      ZOÉ   2016  29      30

 [571 rows x 5 columns],
          sexe   preusuel annais dpt  nombre
 11988       1      AARON   2016  76      70
 13147       1   ABDALLAH   2016  76       3
 17325       1      ABDOU   2016  76       3
 17836       1  ABDOULAYE   2016  76       4
 20974       1       ABEL   2016  76      12
 ...       ...        ...    ...  ..     ...
 3721259     2      ZÉLIE   2016  76      23
 3722937     2      ZINEB   2016  76       5
 3725801     2        ZOÉ   2016  76      77
 3727076     2      ZOHRA   2016  76       4
 3727139     2       ZOLA   2016  76       3

 [1008 rows x 5 columns],
          sexe     preusuel annais dpt  nombre
 12006       1        AARON   2016  94      62
 12542       1          ABD   2016  94       3
 13154       1     ABDALLAH   2016  94      15
 13861       1  ABDEL-MALIK   2016  94       3
 16643       1  ABDELRAHMEN   2016  94       3
 ...       ...          ...    ...  ..     ...
 3722102     2       ZEYNEP   2016  94       5
 3722940     2        ZINEB   2016  94       6
 3723292     2          ZOE   2016  94       4
 3725818     2          ZOÉ   2016  94      36
 3727080     2        ZOHRA   2016  94       5

 [1305 rows x 5 columns],
          sexe  preusuel annais  dpt  nombre
 12008       1     AARON   2016  971       6
 31914       1    ADRIAN   2016  971       3
 56499       1      ALAN   2016  971       4
 87241       1    ALEXIS   2016  971       4
 128975      1     ANGEL   2016  971      10
 ...       ...       ...    ...  ...     ...
 3634767     2   THALINA   2016  971       3
 3634841     2    THALYA   2016  971       5
 3634973     2     THAYS   2016  971       3
 3673940     2  VICTORIA   2016  971       6
 3691117     2     WENDY   2016  971       3

 [292 rows x 5 columns],
          sexe  preusuel annais dpt  nombre
 11948       1     AARON   2016  33      54
 13135       1  ABDALLAH   2016  33       5
 18171       1  ABDULLAH   2016  33       3
 20948       1      ABEL   2016  33      19
 23259       1   ACHILLE   2016  33      15
 ...       ...       ...    ...  ..     ...
 3706264     2     YUSRA   2016  33       3
 3719682     2    ZAYNEB   2016  33       4
 3721227     2     ZÉLIE   2016  33      13
 3722338     2       ZIA   2016  33       6
 3725759     2       ZOÉ   2016  33      67

 [1037 rows x 5 columns],
          sexe   preusuel annais dpt  nombre
 12003       1      AARON   2016  91      39
 13151       1   ABDALLAH   2016  91      11
 17489       1     ABDOUL   2016  91       3
 17839       1  ABDOULAYE   2016  91       7
 18177       1   ABDULLAH   2016  91       3
 ...       ...        ...    ...  ..     ...
 3719692     2     ZAYNEB   2016  91       6
 3721705     2     ZEYNAB   2016  91       5
 3722100     2     ZEYNEP   2016  91       4
 3725815     2        ZOÉ   2016  91      44
 3727078     2      ZOHRA   2016  91       5

 [1047 rows x 5 columns],
          sexe    preusuel annais dpt  nombre
 11922       1       AARON   2016  06      47
 13130       1    ABDALLAH   2016  06       5
 15673       1  ABDELKADER   2016  06       3
 23248       1     ACHILLE   2016  06       5
 25638       1        ADAM   2016  06      82
 ...       ...         ...    ...  ..     ...
 3704216     2       YOMNA   2016  06       3
 3706093     2        YUNA   2016  06       3
 3721207     2       ZÉLIE   2016  06       8
 3725733     2         ZOÉ   2016  06      26
 3727069     2       ZOHRA   2016  06       3

 [869 rows x 5 columns],
          sexe   preusuel annais dpt  nombre
 11927       1      AARON   2016  11      11
 25643       1       ADAM   2016  11      16
 39284       1     ADRIEN   2016  11       3
 41952       1      AHMED   2016  11       3
 80508       1  ALEXANDRE   2016  11       6
 ...       ...        ...    ...  ..     ...
 3633864     2      THAÏS   2016  11       3
 3673884     2   VICTORIA   2016  11       5
 3698349     2    YASMINE   2016  11       4
 3721212     2      ZÉLIE   2016  11       6
 3725738     2        ZOÉ   2016  11      12

 [254 rows x 5 columns],
          sexe      preusuel annais dpt  nombre
 11929       1         AARON   2016  13      95
 13131       1      ABDALLAH   2016  13      13
 15674       1    ABDELKADER   2016  13       8
 16612       1   ABDELRAHMAN   2016  13       3
 17034       1  ABDERRAHMANE   2016  13       6
 ...       ...           ...    ...  ..     ...
 3722550     2          ZINA   2016  13       7
 3722929     2         ZINEB   2016  13       3
 3723275     2           ZOE   2016  13      22
 3725740     2           ZOÉ   2016  13      31
 3727070     2         ZOHRA   2016  13       4

 [1535 rows x 5 columns],
          sexe    preusuel annais dpt  nombre
 11946       1       AARON   2016  31      38
 12537       1         ABD   2016  31       4
 13134       1    ABDALLAH   2016  31       6
 15675       1  ABDELKADER   2016  31       4
 18170       1    ABDULLAH   2016  31       3
 ...       ...         ...    ...  ..     ...
 3720909     2       ZELIE   2016  31      10
 3722337     2         ZIA   2016  31       4
 3722551     2        ZINA   2016  31       3
 3723279     2         ZOE   2016  31      56
 3725757     2         ZOÉ   2016  31       9

 [1039 rows x 5 columns],
          sexe    preusuel annais dpt  nombre
 11949       1       AARON   2016  34      53
 15676       1  ABDELKADER   2016  34       3
 16321       1    ABDELLAH   2016  34       3
 20949       1        ABEL   2016  34       3
 23260       1     ACHILLE   2016  34       6
 ...       ...         ...    ...  ..     ...
 3718882     2       ZAHRA   2016  34       4
 3719065     2       ZAÏNA   2016  34       3
 3721228     2       ZÉLIE   2016  34       8
 3722931     2       ZINEB   2016  34       3
 3725760     2         ZOÉ   2016  34      46

 [926 rows x 5 columns],
          sexe   preusuel annais dpt  nombre
 11934       1      AARON   2016  18      11
 25650       1       ADAM   2016  18      12
 80514       1  ALEXANDRE   2016  18       3
 87174       1     ALEXIS   2016  18       7
 94386       1        ALI   2016  18       6
 ...       ...        ...    ...  ..     ...
 3656555     2  VALENTINE   2016  18       3
 3670662     2   VICTOIRE   2016  18       3
 3673888     2   VICTORIA   2016  18       4
 3698353     2    YASMINE   2016  18       4
 3725745     2        ZOÉ   2016  18       4

 [193 rows x 5 columns],
          sexe preusuel annais dpt  nombre
 11961       1    AARON   2016  49      33
 20958       1     ABEL   2016  49       9
 23266       1  ACHILLE   2016  49       7
 25678       1     ADAM   2016  49      27
 28370       1     ADEM   2016  49       4
 ...       ...      ...    ...  ..     ...
 3704671     2    YOUNA   2016  49       3
 3706103     2     YUNA   2016  49       6
 3719430     2    ZAYNA   2016  49       3
 3721238     2    ZÉLIE   2016  49      22
 3725774     2      ZOÉ   2016  49      45

 [596 rows x 5 columns],
          sexe   preusuel annais dpt  nombre
 11971       1      AARON   2016  59     124
 12539       1        ABD   2016  59       4
 13140       1   ABDALLAH   2016  59      21
 13752       1      ABDEL   2016  59       4
 14143       1  ABDELAZIZ   2016  59       3
 ...       ...        ...    ...  ..     ...
 3726212     2        ZOË   2016  59       4
 3726274     2    ZOÉLINE   2016  59       3
 3726290     2       ZOEY   2016  59       5
 3727072     2      ZOHRA   2016  59       4
 3727135     2       ZOLA   2016  59       3

 [1753 rows x 5 columns],
          sexe  preusuel annais dpt  nombre
 11972       1     AARON   2016  60      20
 13141       1  ABDALLAH   2016  60       5
 20964       1      ABEL   2016  60       5
 25689       1      ADAM   2016  60      72
 26324       1     ADAMA   2016  60       3
 ...       ...       ...    ...  ..     ...
 3705227     2    YOUSRA   2016  60       4
 3720911     2     ZELIE   2016  60       3
 3722554     2      ZINA   2016  60       3
 3723286     2       ZOE   2016  60      22
 3725785     2       ZOÉ   2016  60       3

 [637 rows x 5 columns],
          sexe     preusuel annais dpt  nombre
 11989       1        AARON   2016  77      57
 16865       1  ABDERRAHMAN   2016  77       3
 17837       1    ABDOULAYE   2016  77       4
 18175       1     ABDULLAH   2016  77       4
 20975       1         ABEL   2016  77       5
 ...       ...          ...    ...  ..     ...
 3719520     2       ZAYNAB   2016  77       3
 3719690     2       ZAYNEB   2016  77       6
 3721260     2        ZÉLIE   2016  77       3
 3725802     2          ZOÉ   2016  77      39
 3727077     2        ZOHRA   2016  77       3

 [967 rows x 5 columns],
          sexe preusuel annais dpt  nombre
 11937       1    AARON   2016  21      25
 20940       1     ABEL   2016  21       5
 23253       1  ACHILLE   2016  21       3
 25653       1     ADAM   2016  21      27
 27511       1     ADEL   2016  21       5
 ...       ...      ...    ...  ..     ...
 3698355     2  YASMINE   2016  21       9
 3705218     2   YOUSRA   2016  21       3
 3721220     2    ZÉLIE   2016  21       7
 3725747     2      ZOÉ   2016  21      22
 3727132     2     ZOLA   2016  21       3

 [437 rows x 5 columns],
          sexe      preusuel annais dpt  nombre
 11958       1         AARON   2016  44      42
 13137       1      ABDALLAH   2016  44       5
 17035       1  ABDERRAHMANE   2016  44       3
 20955       1          ABEL   2016  44      14
 23264       1       ACHILLE   2016  44      19
 ...       ...           ...    ...  ..     ...
 3721236     2         ZÉLIE   2016  44      17
 3721738     2      ZEYNABOU   2016  44       3
 3723282     2           ZOE   2016  44      17
 3725769     2           ZOÉ   2016  44      51
 3727134     2          ZOLA   2016  44       3

 [1010 rows x 5 columns],
          sexe preusuel annais  dpt  nombre
 12011       1    AARON   2016  974      50
 20990       1     ABEL   2016  974       5
 25726       1     ADAM   2016  974      31
 31915       1   ADRIAN   2016  974       3
 39350       1   ADRIEN   2016  974      18
 ...       ...      ...    ...  ...     ...
 3706317     2    YVANA   2016  974       3
 3722341     2      ZIA   2016  974       3
 3725822     2      ZOÉ   2016  974      27
 3726214     2      ZOË   2016  974       4
 3727082     2    ZOHRA   2016  974       3

 [910 rows x 5 columns],
          sexe  preusuel annais dpt  nombre
 11980       1     AARON   2016  68      26
 13143       1  ABDALLAH   2016  68       3
 18173       1  ABDULLAH   2016  68       4
 20969       1      ABEL   2016  68       3
 23276       1   ACHILLE   2016  68       4
 ...       ...       ...    ...  ..     ...
 3721252     2     ZÉLIE   2016  68       6
 3722094     2    ZEYNEP   2016  68       8
 3722556     2      ZINA   2016  68       3
 3725793     2       ZOÉ   2016  68      21
 3727073     2     ZOHRA   2016  68       3

 [619 rows x 5 columns],
          sexe preusuel annais dpt  nombre
 11919       1    AARON   2016  02      14
 23247       1  ACHILLE   2016  02       3
 25634       1     ADAM   2016  02      20
 39280       1   ADRIEN   2016  02       3
 42807       1    AIDEN   2016  02       4
 ...       ...      ...    ...  ..     ...
 3698345     2  YASMINE   2016  02       3
 3705476     2  YOUSSRA   2016  02       3
 3721206     2    ZÉLIE   2016  02       3
 3722087     2   ZEYNEP   2016  02       3
 3725729     2      ZOÉ   2016  02      26

 [379 rows x 5 columns],
          sexe preusuel annais dpt  nombre
 11920       1    AARON   2016  03      14
 20935       1     ABEL   2016  03       3
 25635       1     ADAM   2016  03      12
 28346       1     ADEM   2016  03       3
 59911       1    ALBAN   2016  03       6
 ...       ...      ...    ...  ..     ...
 3587686     2   SOPHIE   2016  03       3
 3633861     2    THAÏS   2016  03       5
 3635586     2     THÉA   2016  03       5
 3698346     2  YASMINE   2016  03       4
 3725730     2      ZOÉ   2016  03       8

 [249 rows x 5 columns],
          sexe   preusuel annais dpt  nombre
 11924       1      AARON   2016  08       4
 25640       1       ADAM   2016  08       8
 80506       1  ALEXANDRE   2016  08       5
 87165       1     ALEXIS   2016  08       3
 106486      1     AMAURY   2016  08       5
 ...       ...        ...    ...  ..     ...
 3563053     2      SOFIA   2016  08       4
 3574993     2     SOLINE   2016  08       6
 3635590     2       THÉA   2016  08       3
 3721209     2      ZÉLIE   2016  08       6
 3725735     2        ZOÉ   2016  08      16

 [178 rows x 5 columns],
          sexe preusuel annais dpt  nombre
 11928       1    AARON   2016  12       8
 25644       1     ADAM   2016  12      17
 41953       1    AHMED   2016  12       3
 59914       1    ALBAN   2016  12       5
 67044       1    ALBIN   2016  12       3
 ...       ...      ...    ...  ..     ...
 3574994     2   SOLINE   2016  12       3
 3633865     2    THAÏS   2016  12       3
 3647047     2     TINA   2016  12       5
 3721213     2    ZÉLIE   2016  12       8
 3725739     2      ZOÉ   2016  12      17

 [211 rows x 5 columns],
          sexe  preusuel annais dpt  nombre
 11930       1     AARON   2016  14      24
 20937       1      ABEL   2016  14       7
 23250       1   ACHILLE   2016  14       7
 25646       1      ADAM   2016  14      21
 28351       1      ADEM   2016  14       5
 ...       ...       ...    ...  ..     ...
 3680003     2  VIOLETTE   2016  14       7
 3698351     2   YASMINE   2016  14       5
 3706095     2      YUNA   2016  14       3
 3721215     2     ZÉLIE   2016  14      23
 3725741     2       ZOÉ   2016  14      36

 [475 rows x 5 columns],
          sexe  preusuel annais dpt  nombre
 11940       1     AARON   2016  25      25
 13132       1  ABDALLAH   2016  25       3
 20942       1      ABEL   2016  25      11
 25657       1      ADAM   2016  25      31
 27513       1      ADEL   2016  25       4
 ...       ...       ...    ...  ..     ...
 3698357     2   YASMINE   2016  25      12
 3721222     2     ZÉLIE   2016  25       7
 3722089     2    ZEYNEP   2016  25       3
 3722930     2     ZINEB   2016  25       3
 3725751     2       ZOÉ   2016  25      27

 [565 rows x 5 columns],
          sexe preusuel annais dpt  nombre
 11950       1    AARON   2016  35      43
 20950       1     ABEL   2016  35      12
 23261       1  ACHILLE   2016  35       7
 25667       1     ADAM   2016  35      36
 27517       1     ADEL   2016  35       3
 ...       ...      ...    ...  ..     ...
 3706100     2     YUNA   2016  35      20
 3721229     2    ZÉLIE   2016  35      23
 3723280     2      ZOE   2016  35       3
 3725761     2      ZOÉ   2016  35      47
 3726258     2   ZOÉLIE   2016  35       3

 [828 rows x 5 columns],
          sexe  preusuel annais dpt  nombre
 11957       1     AARON   2016  42      25
 13136       1  ABDALLAH   2016  42       4
 20954       1      ABEL   2016  42       3
 25674       1      ADAM   2016  42      49
 27519       1      ADEL   2016  42       8
 ...       ...       ...    ...  ..     ...
 3691093     2     WENDY   2016  42       4
 3692920     2    YAËLLE   2016  42       3
 3698369     2   YASMINE   2016  42       8
 3721235     2     ZÉLIE   2016  42       8
 3725768     2       ZOÉ   2016  42      34

 [698 rows x 5 columns],
          sexe  preusuel annais dpt  nombre
 11966       1     AARON   2016  54      24
 13139       1  ABDALLAH   2016  54       5
 20960       1      ABEL   2016  54       9

In [178]:
dep_year_popular_name["2016"]

#find the popular name for a given year and departement

def popular_name_dep(year='1990', departement='01'):
    dpt=''
    for i in range(len(dep_year_popular_name[year])):
        df_popular_name=dep_year_popular_name[year][i].sort_values(by=['nombre'],ascending=False)
        if not df_popular_name[:1].empty :
            dpt=df_popular_name[:1]["dpt"].values[0]
        if departement==dpt:
            #print(dpt)
            if not df_popular_name[:1].empty :
                pop_name=df_popular_name[:1]["preusuel"].values[0]
    return pop_name

717837    29
Name: dpt, dtype: object

In [179]:
year="1990"

popular_name_dep(year,"80")

'KEVIN'

### First visualisation:

In [185]:
### find the 10 popular names in each year

nat_data_name_popular={}  #dictionnary of the 10 popular names for each year
nat_exten_name_popular={} #dictionnary of the 50 popular names for each year
    
    
for i in range(len(List_year)):
     nat_data_name[List_year[i]]=nat_data_name[List_year[i]].sort_values(by=['nombre'],ascending=False)
     nat_data_name_popular[List_year[i]]=nat_data_name[List_year[i]][:10]
     nat_exten_name_popular[List_year[i]]=nat_data_name[List_year[i]][:50]
print(list(nat_data_name_popular['1920']['preusuel'])) #perfect

['MARIE', 'JEAN', 'ANDRÉ', 'JEANNE', 'PIERRE', 'RENÉ', 'MARCEL', 'ROGER', 'LOUIS', 'HENRI']

In [181]:
def make_altair_chart(year):
    
    chart = alt.Chart(nat_data_name_popular[year]).mark_bar().encode(
        x='preusuel:N',
        y='nombre:Q',
        color='preusuel:N',
        tooltip='preusuel:N'
    )

    return chart


interact(make_altair_chart, year=List_year)

interactive(children=(Dropdown(description='year', options=('1900', '1901', '1902', '1903', '1904', '1905', '1…

## Second visualisation

In [182]:
# departement data

departement = gpd.read_file('departements-version-simplifiee.geojson')

departement.sample(5)

   code       nom                                           geometry
80   80     Somme  POLYGON ((1.38155 50.06577, 1.45388 50.11033, ...
55   55     Meuse  POLYGON ((4.95099 49.23687, 4.96436 49.24745, ...
23   25     Doubs  POLYGON ((6.80701 47.56280, 6.81666 47.54792, ...
58   58    Nièvre  POLYGON ((2.87463 47.52042, 2.84890 47.53754, ...
56   56  Morbihan  MULTIPOLYGON (((-3.42179 47.62000, -3.44067 47...

In [183]:

names_after_merge = departement.merge(names, how='right', left_on='code', right_on='dpt')

names_after_merge.sample(5)

,code,nom,geometry,sexe,preusuel,annais,dpt,nombre
68002,29,Finistère,"MULTIPOLYGON (((-5.10260 48.43612, -5.10360 48...",1,ALEXANDRE,2007,29,43
1437836,79,Deux-Sèvres,"POLYGON ((-0.89196 46.97582, -0.85592 46.97908...",1,ROMAIN,2002,79,19
3351196,88,Vosges,"POLYGON ((5.47006 48.42093, 5.51099 48.41822, ...",2,PERRINE,1983,88,4
2454162,59,Nord,"MULTIPOLYGON (((3.04040 50.15971, 3.06301 50.1...",2,GAËLLE,2012,59,5
1922203,75,Paris,"POLYGON ((2.41634 48.84924, 2.46226 48.84254, ...",2,ASSA,1989,75,11

In [186]:

#add popular name tp table
dr_List_year=Dropdown(options=List_year)
dr_name=Dropdown(options=list(nat_exten_name_popular['1990']['preusuel']))

def update(*args):
    #print(nat_data_name['2016'])
    selected_year=dr_List_year.value
    #print(selected_year)
    dr_name.options = list(nat_exten_name_popular[dr_List_year.value]['preusuel'])
dr_List_year.observe(update)
             
def make_altair_geo_chart(year,name):
      big_subset=[]
      grouped = names.groupby(['dpt', 'preusuel', 'sexe'], as_index=False).sum()
      grouped = departement.merge(grouped, how='right', left_on='code', right_on='dpt')
      subset=grouped[grouped.preusuel == name]
      my_chart=alt.Chart(subset).mark_geoshape(stroke='white').encode(
      tooltip=['preusuel:N','nom:N', 'code:N', 'nombre:N'],
      color='nombre',
      ).properties(width=800, height=600)
      my_selected_year=year
      return my_chart
        
  

interact(make_altair_geo_chart, year=dr_List_year, name=dr_name)

interactive(children=(Dropdown(description='year', options=('1900', '1901', '1902', '1903', '1904', '1905', '1…